11/data/attachments/2f7c22bab8654949.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>John_section_Friend_38239_2</nif:username>
            <nif:friendToBeRequested>soap_friends_2a65597f-1b65-4443-ac68-bb0f9ed069c2</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>